Documents/ОзнакомительныйВыезд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОзнакомительныйВыезд</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПодготовкаПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГабаритныеЧертежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГабаритныйЧертеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОзнакомительныйВыезд/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаголовкиЗакладок("");
	Элементы.Основание.Видимость = ЗначениеЗаполнено(Объект.Основание);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменениеЗамеров", Объект.Ссылка);

КонецПроцедуры

#КонецОбласти


#Область Команды

&НаКлиенте
Процедура ЗаполнитьГЧ(Команда)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда 
		мГЧ_в_ТЧ = Новый Массив;
		
		Для каждого х Из Объект.ГабаритныеЧертежи Цикл
			мГЧ_в_ТЧ.Добавить(х.ГабаритныйЧертеж);
		КонецЦикла; 
		
		Для каждого текГабаритныйЧертеж Из ПолучитьГЧНаСервере(Объект.Проект, мГЧ_в_ТЧ) Цикл
		
			НС = Объект.ГабаритныеЧертежи.Добавить();
			НС.ГабаритныйЧертеж = текГабаритныйЧертеж;
		
		КонецЦикла;
		
		ЗаголовкиЗакладок("ГабаритныеЧертежи");
		
	Иначе
		ПоказатьПредупреждение(, "Не заполнена Проект.");
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьГЧНаСервере(Сделка, мГЧ_в_ТЧ)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Проект = &Проект
		|	И НЕ ГабаритныеЧертежи.Ссылка В (&мГЧ_в_ТЧ)
		|	И НЕ ГабаритныеЧертежи.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГабаритныеЧертежи.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	Запрос.УстановитьПараметр("мГЧ_в_ТЧ", мГЧ_в_ТЧ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПомещенияНаСервере(Сделка, мПомещения_в_ТЧ)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Помещения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Проект = &Проект
		|	И НЕ Помещения.Ссылка В (&мПомещения_в_ТЧ)
		|	И НЕ Помещения.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Помещения.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	Запрос.УстановитьПараметр("мПомещения_в_ТЧ", мПомещения_в_ТЧ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

&НаКлиенте
Процедура ЗаполнитьПомещения(Команда)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда 
		мПомещения_в_ТЧ = Новый Массив;
		
		Для каждого х Из Объект.Помещения Цикл
			мПомещения_в_ТЧ.Добавить(х.Помещение);
		КонецЦикла; 
		
		Для каждого текПомещение Из ПолучитьПомещенияНаСервере(Объект.Проект, мПомещения_в_ТЧ) Цикл
		
			НС = Объект.Помещения.Добавить();
			НС.Помещение = текПомещение;
		
		КонецЦикла;
		
		ЗаголовкиЗакладок("Помещения");
		
	Иначе
		ПоказатьПредупреждение(, "Не заполнена Проект.");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ЗаголовкиЗакладок(ИмяЗакладки = "")

	Если ИмяЗакладки = "" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы, "ГруппаГабаритныеЧертежи"	,"Габаритные чертежи"	,Объект.ГабаритныеЧертежи);
		омОформлениеФормы.ЗаголовокЗакладки(Элементы, "ГруппаПомещения"			,"Помещения"			,Объект.Помещения);
		омОформлениеФормы.ЗаголовокЗакладки(Элементы, "ГруппаИсполнители"		,"Исполнители"			,Объект.Исполнители);
	ИначеЕсли ИмяЗакладки = "ГабаритныеЧертежи" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы, "ГруппаГабаритныеЧертежи"	,"Габаритные чертежи"	,Объект.ГабаритныеЧертежи);
	ИначеЕсли ИмяЗакладки = "Исполнители" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы, "ГруппаИсполнители"		,"Исполнители"			,Объект.Исполнители);
	ИначеЕсли ИмяЗакладки = "Помещения" Тогда
		омОформлениеФормы.ЗаголовокЗакладки(Элементы, "ГруппаПомещения"			,"Помещения"			,Объект.Помещения);
	КонецЕсли;

КонецПроцедуры // ЗаголовкиЗакладок()

&НаКлиенте
Процедура ПроектОчищен(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	стСообщенияП 			= "";
	стСообщенияГЧ 			= "";
	КоличествоТЧДляОчистки 	= 0;
	
	Если Объект.Помещения.Количество() > 0 Тогда
		
		КоличествоТЧДляОчистки = КоличествоТЧДляОчистки + 1;
		стСообщенияП = "Помещения";
	
	КонецЕсли;
	
	Если Объект.ГабаритныеЧертежи.Количество() > 0 Тогда
		
		КоличествоТЧДляОчистки = КоличествоТЧДляОчистки + 1;
		стСообщенияГЧ = "Габаритные чертежи";
	
	КонецЕсли;
	
	Если КоличествоТЧДляОчистки = 1 Тогда
	
		стСообщение = "очищена табличная часть " + ?(ПустаяСтрока(стСообщенияП), стСообщенияГЧ, стСообщенияП);	
	
	Иначе
	
		стСообщение = "очищены табличные части " + стСообщенияП + " и " + стСообщенияГЧ;	
	
	КонецЕсли;
	
	Если КоличествоТЧДляОчистки = 0 Тогда 
		ОткрытьФормуВыбораПроекта();
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеПроекта",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекты будет " + стСообщение + ". Продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеВопросаОСменеПроекта(Результат, ДополнительныйПараметр) Экспорт
    Если Результат = КодВозвратаДиалога.ДА Тогда
		ОткрытьФормуВыбораПроекта();
    КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ОткрытьФормуВыбораПроекта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",						Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",				Ложь);
	ПараметрыФормы.Вставить("ОтсутствующиеВПланированииСделки", Ложь);
	ПараметрыФормы.Вставить("НаименованиеСрока",				"ЗапускВРаботу");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры // ОткрытьФормуВыбораСделки()


&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Объект.Проект = Значение;
	Объект.Помещения.Очистить();
	Объект.ГабаритныеЧертежи.Очистить();
	
	ЗаголовкиЗакладок("");

	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПриИзменении(Элемент)
	ЗаголовкиЗакладок("Исполнители");
КонецПроцедуры


&НаКлиенте
Процедура ПомещенияПомещениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(объект.Проект) Тогда
	
		ПоказатьПредупреждение(,"Не заполнена Проект");
		Возврат;
	
	КонецЕсли;
	
	ДополнительныйПараметр = Новый Структура("ТекущиеДанные", Элемент.Родитель.ТекущиеДанные);

	Отказ = Истина;
	
	НеПоказыватьВВыборе = Новый Массив;
	
	Для каждого х Из Объект.Помещения Цикл
		НеПоказыватьВВыборе.Добавить(х.Помещение);	
	КонецЦикла;
	
	омПомещениеКлиент.ОткрытьПодборПомещения(Объект, ЭтаФорма, , ДополнительныйПараметр, НеПоказыватьВВыборе, Истина);

КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораПомещения(Результат, ДополнительныйПараметр) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныйПараметр = Неопределено Тогда
		
		Для каждого Помещение Из Результат Цикл
			
			НС = Объект.Помещения.Добавить();
			НС.Помещение = Помещение;
			
		КонецЦикла;
		
	Иначе 
		Если Результат.Количество() = 0 Тогда
		
			Возврат;	
		
		КонецЕсли;
		
		ДополнительныйПараметр.ТД.Помещение = Результат[0];
		
	КонецЕсли; 
	
	ЗаголовкиЗакладок("Помещения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Если Объект.Помещения.Количество() = 0 Тогда
		НеПоказыватьПомещения = Неопределено;
	Иначе
		НеПоказыватьПомещения = Новый Массив;
		
		Для каждого х Из Объект.Помещения Цикл
			НеПоказыватьПомещения.Добавить(х.Помещение);
		КонецЦикла;
		
	КонецЕсли;
	
	омПомещениеКлиент.ОткрытьПодборПомещения(Объект, ЭтаФорма, , , НеПоказыватьПомещения, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГабаритныеЧертежиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.ГабаритныеЧертежи.Количество() = 0 Тогда
		НеПоказыватьГЧ = Неопределено;
	Иначе
		НеПоказыватьГЧ = Новый Массив;
		
		Для каждого х Из Объект.ГабаритныеЧертежи Цикл
			НеПоказыватьГЧ.Добавить(х.ГабаритныйЧертеж);
		КонецЦикла;
		
	КонецЕсли;
	
	омГабаритныйЧертежНаКлиенте.ОткрытьПодборГЧ(Объект, ЭтаФорма, , , НеПоказыватьГЧ, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораГЧ(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Если НЕ Результат = Неопределено Тогда
			
			Для каждого ГабаритныйЧертеж Из Результат Цикл
				
				НС = Объект.ГабаритныеЧертежи.Добавить();
				НС.ГабаритныйЧертеж = ГабаритныйЧертеж;
				
			КонецЦикла;
			
		КонецЕсли;                         
		
	Иначе
		ДополнительныеПараметры.ТД.ГабаритныйЧертеж = Результат;	
	КонецЕсли; 
	
	ЗаголовкиЗакладок("ГабаритныеЧертежи");
	
КонецПроцедуры // ПослеВыбораЭлементовСделки() 

&НаКлиенте
Процедура ПомещенияПриИзменении(Элемент)
	ЗаголовкиЗакладок("Помещения");
КонецПроцедуры

&НаКлиенте
Процедура ГабаритныеЧертежиПриИзменении(Элемент)
	ЗаголовкиЗакладок("ГабаритныеЧертежи");
КонецПроцедуры
